### List of Changed Stacks

```bash
stacks/modules
exitcode=0
stdout<<EOF
stacks/modules
EOF
stderr<<EOF
EOF
```

#### Terraform Plan

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master-module.aws_instance.master_instance will be created
  + resource "aws_instance" "master_instance" {
      + ami                                  = "ami-07caf09b362be10b8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-066d0bddfd2c1c8ce"
      + tags                                 = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_master_instance"
        }
      + tags_all                             = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_master_instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # module.master-module.aws_instance.test_module_instance will be destroyed
  # (because aws_instance.test_module_instance is not in configuration)
  - resource "aws_instance" "test_module_instance" {
      - ami                                  = "ami-07caf09b362be10b8" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:295093822487:instance/i-085e813f6067e1022" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1d" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-085e813f6067e1022" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0c6c3643b78e4042c" -> null
      - private_dns                          = "ip-172-31-131-29.ec2.internal" -> null
      - private_ip                           = "172.31.131.29" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "Azamon_allow_internet_traffic_master",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-066d0bddfd2c1c8ce" -> null
      - tags                                 = {
          - "Name" = "Azamon_master_instance"
        } -> null
      - tags_all                             = {
          - "Name" = "Azamon_master_instance"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0e914037b846409f1",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-057869bb9dbadf616" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # module.master-module.aws_subnet.master_public_subnet will be updated in-place
  ~ resource "aws_subnet" "master_public_subnet" {
        id                                             = "subnet-066d0bddfd2c1c8ce"
      ~ tags                                           = {
          + "Client" = "Azamon"
            "Name"   = "Azamon_master_subnet"
        }
      ~ tags_all                                       = {
          + "Client" = "Azamon"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.master-module.aws_vpc_security_group_egress_rule.allow_slave_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_slave_egress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_internet_traffic_global must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "allow_internet_traffic_global" {
      ~ arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-0649cf8289e9756c8" -> (known after apply)
      ~ id                     = "sgr-0649cf8289e9756c8" -> (known after apply)
      ~ security_group_id      = "sg-0e914037b846409f1" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0649cf8289e9756c8" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_slave_ingress must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "allow_slave_ingress" {
      ~ arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-00c7ffe661e144cae" -> (known after apply)
      ~ id                           = "sgr-00c7ffe661e144cae" -> (known after apply)
      ~ referenced_security_group_id = "sg-02515aaf051c9efa6" -> (known after apply)
      ~ security_group_id            = "sg-0e914037b846409f1" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-00c7ffe661e144cae" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sg.aws_security_group.allow_internet_traffic_master will be destroyed
  # (because aws_security_group.allow_internet_traffic_master is not in configuration)
  - resource "aws_security_group" "allow_internet_traffic_master" {
      - arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group/sg-0e914037b846409f1" -> null
      - description            = "Allow inbound traffic and all outbound traffic to the master of Azamon" -> null
      - egress                 = [] -> null
      - id                     = "sg-0e914037b846409f1" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-02515aaf051c9efa6",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "Azamon_allow_internet_traffic_master" -> null
      - owner_id               = "295093822487" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "Azamon_allow_internet_traffic_master"
        } -> null
      - tags_all               = {
          - "Name" = "Azamon_allow_internet_traffic_master"
        } -> null
      - vpc_id                 = "vpc-08c07fc88ec42d090" -> null
    }

  # module.sg.aws_security_group.allow_master_traffic_slave will be destroyed
  # (because aws_security_group.allow_master_traffic_slave is not in configuration)
  - resource "aws_security_group" "allow_master_traffic_slave" {
      - arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group/sg-02515aaf051c9efa6" -> null
      - description            = "Allow inbound traffic and all outbound traffic to the master of Azamon" -> null
      - egress                 = [] -> null
      - id                     = "sg-02515aaf051c9efa6" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0e914037b846409f1",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "Azamon_slave_sg" -> null
      - owner_id               = "295093822487" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "Azamon_slave_sg"
        } -> null
      - tags_all               = {
          - "Name" = "Azamon_slave_sg"
        } -> null
      - vpc_id                 = "vpc-08c07fc88ec42d090" -> null
    }

  # module.sg.aws_security_group.master_sg will be created
  + resource "aws_security_group" "master_sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic and all outbound traffic to the master of Azamon"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Azamon_allow_internet_traffic_master"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_master_sg"
        }
      + tags_all               = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_master_sg"
        }
      + vpc_id                 = "vpc-08c07fc88ec42d090"
    }

  # module.sg.aws_security_group.slave_sg will be created
  + resource "aws_security_group" "slave_sg" {
      + arn                    = (known after apply)
      + description            = "Segurity group for the slave structure of the client Azamon"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Azamon_slave_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_slave_sg"
        }
      + tags_all               = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_slave_sg"
        }
      + vpc_id                 = "vpc-08c07fc88ec42d090"
    }

  # module.slave-module.aws_launch_template.slave_launch_template will be updated in-place
  ~ resource "aws_launch_template" "slave_launch_template" {
        id                      = "lt-0ce74ba34c66d7ae8"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "Azamon_template20240508223042016500000001"
        tags                    = {}
      ~ vpc_security_group_ids  = [
          - "sg-02515aaf051c9efa6",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ tag_specifications {
          ~ tags          = {
              + "Client" = "Azamon"
                "Name"   = "Azamon"
            }
            # (1 unchanged attribute hidden)
        }
    }

  # module.slave-module.aws_security_group.allow_internet_traffic will be destroyed
  # (because aws_security_group.allow_internet_traffic is not in configuration)
  - resource "aws_security_group" "allow_internet_traffic" {
      - arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group/sg-02c7b9e822c9d9d00" -> null
      - description            = "Allow inbound traffic and all outbound traffic to the slave of Azamon" -> null
      - egress                 = [] -> null
      - id                     = "sg-02c7b9e822c9d9d00" -> null
      - ingress                = [] -> null
      - name                   = "Azamon_slave" -> null
      - owner_id               = "295093822487" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "Azamon_slave"
        } -> null
      - tags_all               = {
          - "Name" = "Azamon_slave"
        } -> null
      - vpc_id                 = "vpc-08c07fc88ec42d090" -> null
    }

  # module.slave-module.aws_subnet.slave_public_subnet will be updated in-place
  ~ resource "aws_subnet" "slave_public_subnet" {
        id                                             = "subnet-05624ae6f2cb7dc2a"
      ~ tags                                           = {
          + "Client" = "Azamon"
            "Name"   = "Azamon_slave_subnet"
        }
      ~ tags_all                                       = {
          + "Client" = "Azamon"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.slave-module.aws_vpc_security_group_egress_rule.egress_from_master_sg will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Egress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.slave-module.aws_vpc_security_group_ingress_rule.allow_ingress_from_master will be destroyed
  # (because aws_vpc_security_group_ingress_rule.allow_ingress_from_master is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "allow_ingress_from_master" {
      - arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-01b87917772250e16" -> null
      - id                           = "sgr-01b87917772250e16" -> null
      - ip_protocol                  = "-1" -> null
      - referenced_security_group_id = "sg-0e914037b846409f1" -> null
      - security_group_id            = "sg-02515aaf051c9efa6" -> null
      - security_group_rule_id       = "sgr-01b87917772250e16" -> null
      - tags_all                     = {} -> null
    }

  # module.slave-module.aws_vpc_security_group_ingress_rule.ingress_from_master_sg will be created
  + resource "aws_vpc_security_group_ingress_rule" "ingress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Ingress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

Plan: 8 to add, 3 to change, 7 to destroy.
```

<!-- Sticky Pull Request Commentterraform-plan -->